; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(armempty)
		(holding ?x)
	)
	; robot trzyma klocek, k³adzie na inny
	(:action stack
		:parameters (?x ?y)
		:precondition
		(and
			(holding ?x)
			(clear ?y)
		)
		:effect
		(and
			(not (holding ?x))
			(not (clear ?y))
			(on-top ?x ?y)
			(clear ?x)
			(armempty)
		)
	)
	; robot nic nie trzyma, zdejmuje klocek z innego
	(:action unstack
		:parameters (?x ?y)
		:precondition
		(and
			(armempty)
			(on-top ?x ?y)
			(clear ?x)
		)
		:effect
		(and
			(not (armempty))
			(not (on-top ?x ?y))
			(not (clear ?x))
			(holding ?x)
			(clear ?y)
		)
	)
	; robot trzyma klocek, k³adzie na pod³odze
	(:action putdown
		:parameters (?x)
		:precondition
		(and
			(holding ?x)
		)
		:effect
		(and
			(not (holding ?x))
			(on-floor ?x)
			(clear ?x)
			(armempty)
		)
	)
	; robot nic nie trzyma, podnosi z pod³ogi
	(:action pickup
		:parameters (?x)
		:precondition
		(and
			(armempty)
			(on-floor ?x)
			(clear ?x)
		)
		:effect
		(and
			(holding ?x)
			(not(on-floor ?x))
			(not(clear ?x))
			(not(armempty))
		)
	)
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c)
	(:init
		(clear c)
		(on-top c b)
		(on-top b a)
		(on-floor a)
		(armempty)
	)
	(:goal
		(and
			(clear a)
			(on-top a b)
			(on-top b c)
			(on-floor c)
		)
	)
)

; plan
1. (unstack c b)
   deleted: (armempty) (on-top c b) (clear c)
   added: (holding c) (clear b)
   goals met: 0 of 4
2. (putdown c)
   deleted: (holding c)
   added: (on-floor c) (clear c) (armempty)
   goals met: 1 of 4
3. (unstack b a)
   deleted: (armempty) (on-top b a) (clear b)
   added: (holding b) (clear a)
   goals met: 2 of 4
4. (stack b c)
   deleted: (holding b) (clear c)
   added: (on-top b c) (clear b) (armempty)
   goals met: 3 of 4
5. (pickup a)
   deleted: (on-floor a) (clear a) (armempty)
   added: (holding a)
   goals met: 2 of 4
6. (stack a b)
   deleted: (holding a) (clear b)
   added: (on-top a b) (clear a) (armempty)
   goals met: 4 of 4
